import {NewsItem} from "@/components/ui/NewsCard.tsx";

export const news: NewsItem[] = [
    {
        id: '3',
        title: 'Вступ ТОТ',
        date: '24 квітня 2026',
        images: [
            '/files/news/tot/1.jpg',
            '/files/news/tot/2.jpg',
            '/files/news/tot/3.jpg',
            '/files/news/tot/4.jpg',
            '/files/news/tot/5.jpg',
            '/files/news/tot/6.jpg',
            '/files/news/tot/7.jpg',
            '/files/news/tot/8.jpg',
            '/files/news/tot/9.jpg',
            '/files/news/tot/10.jpg',
            '/files/news/tot/11.jpg'
        ],
        category: 'Вступ ТОТ',
        content: `
        Україна чекає на дітей і молодь з ТОТ та створює умови, щоб цей шлях був реальним, доступним і безпечним.
Зібрали ключову інформацію: як подати документи, які спрощені умови діють та на яку підтримку можна розраховувати.
Вступникам із ТОТ не обов’язково складати НМТ — можна пройти співбесіду в закладі освіти з предметів НМТ. Якщо виїзд відбувся після 1 жовтня 2025 року або людина досі перебуває на ТОТ — вступ можливий без НМТ. Якщо ж виїзд був раніше — потрібні результати тесту, але діє квота-2.
Квота-2 передбачає окремий конкурс на бюджетні місця: у ньому беруть участь вступники з ТОТ та територій активних бойових дій. У більшості університетів це 10% місць (але не менше одного), а в переміщених ЗВО — до 40%.
Допомогу зі вступом забезпечують освітні центри «Крим-Україна» та «Донбас-Україна», які працюють з 1 червня до 30 вересня. Вони супроводжують на всіх етапах: від складання необхідних оцінювань до подачі документів і проходження співбесіди. Частину процесів можна пройти дистанційно — ще до виїзду.
Вступ можливий навіть без паспорта — достатньо свідоцтва про народження. Паспорт громадянина України можна оформити вже після зарахування.
На час вступу надається безплатне житло, а молодь до 23 років може отримати одноразову державну допомогу — 50 000 грн. Також передбачені стипендії, пільгове проживання в гуртожитках і додаткова підтримка після переїзду.
Якщо ви тільки плануєте виїзд — звертайтеся. У межах ініціативи Bring Kids Back UA допомагають виїхати безкоштовно, конфіденційно та з повним супроводом — навіть якщо немає документів. Для кожного підбирають безпечний маршрут.
Якщо ви не готові вступати одразу, доступні підготовчі програми, зокрема «нульовий курс», щоб підтягнути знання з українознавчого компоненту, адаптуватися та спокійно підготуватися до навчання.
Вступ і навчання не потрібно проходити самостійно — на кожному етапі є супровід і підтримка.
Якщо вам потрібна інформація про вступ до українських університетів, процедуру подання документів або освітні можливості — звертайтесь до організацій та державних інституцій за посиланням у bio профілю.
        `
    },
    {
        id: '3',
        title: 'Тиждень протидії булінгу',
        date: '23 вересня 2025',
        images: ['/files/news/3_1.jpg', '/files/news/3_2.jpg', '/files/news/3_3.jpg', '/files/news/3_4.jpg', '/files/news/3_5.jpg'],
        category: 'Булінг',
        content: `У рамках Тижня протидії булінгу та насильству в Таїровському ліцеї психолог Олег Цандр провів із учнями 5-х класів тренінгові заняття та організував перегляд відеороликів про запровадження адміністративної відповідальності за вчинення булінгу. Діти повинні розуміти, що фізичне залякування, побиття, стусани, підніжки, поштовхи, блокування або дотики небажаним і неналежним чином-це все булінг! Соціальне залякування або цькування із застосуванням тактики ізоляції-це теж булінг!`
    },
    {
        id: 'old_1',
        title: "Допомога військовим – справа честі!",
        date: "22 вересня 2025",
        content: "Таїрівський ліцей отримав подяку та унікальний приз від військових.\n" +
            "У червні 2025 року  Таїрівський ліцей,  передав кошти з  благодійного ярмарку на ремонт військових автомобілів. Це стало нашим спільним внеском у підтримку захисників України.\n" +
            "Сьогодні ми отримали високу відзнаку від 508 окремого ремонтно-відновлювального батальйону – грамоту за відданість Батьківщині, патріотизм, рішучість та відповідальність.\n" +
            "Особливим подарунком для ліцею став гусеничний трак від британської бойової машини М-113. Ця машина брала участь у бойових діях: вивозила поранених воїнів та підвозила боєкомплект. Тепер цей символ мужності та незламності буде нагадувати всій нашій шкільній родині про ціну свободи та важливість підтримки наших захисників.\n" +
            "Ми пишаємося, що спільними зусиллями робимо свій внесок у перемогу України! 💙💛",
        category: "Благодійність",
        images: ['/files/news/old_1_1.jpg', '/files/news/old_1_2.jpg', '/files/news/old_1_3.jpg', '/files/news/old_1_4.jpg'],
    },
    {
        id: 'old_2',
        title: "Правила дорожнього руху – вивчаємо з дитинства!",
        date: "19 вересня",
        content: "В рамках Місячника правил дорожнього руху поліцейським громади Євгеном БЕДРІЙОМ та поліцейською Таїровського ліцею Іриною СКАЛОЮ було проведено практичне заняття з правил дорожнього руху пешехода.",
        category: "Безпека",
        images: ['/files/news/old_2_1.jpg', '/files/news/old_2_2.jpg', '/files/news/old_2_3.jpg', '/files/news/old_2_4.jpg', "/files/news/old_2_5.jpg", "/files/news/old_2_6.jpg", '/files/news/old_2_7.jpg'],
    },
    {
        id: '2',
        title: 'День матері в Таїровському ліцеї',
        date: '09 травня 2025',
        images: [],
        category: 'Свята',
        content:
            `
            <p>У пʼятницю, 9.05, в 2-А класі (кл. керівник Сагінова О. А.) був особливий день — святкували День матері. Стільки щирих посмішок, обіймів і вдячних слів! Діти старалися від усього серця, і кожна мама в залі відчула, наскільки вона важлива й незамінна.</p>
            <p>Зі святом, наші найкращі мами! Ви — серце кожної родини.</p>`
    },
    {
        id: '1',
        title: 'День Європи в Таїровському ліцеї',
        date: '09 травня 2025',
        images: [],
        category: 'Свята',
        content: `
            <p>Кожен клас – своя європейська зірка! 🌟 </p>
            <p>Жеребкування об'єднало учнів Таїровського ліцею в спільному творчому проєкті до Дня Європи. З цікавістю дізнавшись свою країну, діти з ентузіазмом взялися за створення стенгазет. І ось результат – перші витвори юних талантів, сповнені знань та креативу! 🇪🇺📰</p>
            <p>Європа - це про спільні цінності, повагу та натхнення!</p>`
    }
];
