import {NewsItem} from "@/components/ui/NewsCard.tsx";

export const news: NewsItem[] = [
    {
        id: '3',
        title: 'Тиждень протидії булінгу',
        date: '23 вересня 2025',
        images: ['/files/news/3_1.jpg', '/files/news/3_2.jpg', '/files/news/3_3.jpg', '/files/news/3_4.jpg', '/files/news/3_5.jpg'],
        category: 'Булінг',
        content: `У рамках Тижня протидії булінгу та насильству в Таїровському ліцеї психолог Олег Цандр провів із учнями 5-х класів тренінгові заняття та організував перегляд відеороликів про запровадження адміністративної відповідальності за вчинення булінгу. Діти повинні розуміти, що фізичне залякування, побиття, стусани, підніжки, поштовхи, блокування або дотики небажаним і неналежним чином-це все булінг! Соціальне залякування або цькування із застосуванням тактики ізоляції-це теж булінг!`
    },
    {
        id: 'old_1',
        title: "Допомога військовим – справа честі!",
        date: "22 вересня 2025",
        content: "Таїровський ліцей отримав подяку та унікальний приз від військових.\n" +
            "У червні 2025 року  Таїровський ліцей,  передав кошти з  благодійного ярмарку на ремонт військових автомобілів. Це стало нашим спільним внеском у підтримку захисників України.\n" +
            "Сьогодні ми отримали високу відзнаку від 508 окремого ремонтно-відновлювального батальйону – грамоту за відданість Батьківщині, патріотизм, рішучість та відповідальність.\n" +
            "Особливим подарунком для ліцею став гусеничний трак від британської бойової машини М-113. Ця машина брала участь у бойових діях: вивозила поранених воїнів та підвозила боєкомплект. Тепер цей символ мужності та незламності буде нагадувати всій нашій шкільній родині про ціну свободи та важливість підтримки наших захисників.\n" +
            "Ми пишаємося, що спільними зусиллями робимо свій внесок у перемогу України! 💙💛",
        category: "Благодійність",
        images: ['/files/news/old_1_1.jpg', '/files/news/old_1_2.jpg', '/files/news/old_1_3.jpg', '/files/news/old_1_4.jpg'],
    },
    {
        id: 'old_2',
        title: "Правила дорожнього руху – вивчаємо з дитинства!",
        date: "19 вересня",
        content: "В рамках Місячника правил дорожнього руху поліцейським громади Євгеном БЕДРІЙОМ та поліцейською Таїровського ліцею Іриною СКАЛОЮ було проведено практичне заняття з правил дорожнього руху пешехода.",
        category: "Безпека",
        images: ['/files/news/old_2_1.jpg', '/files/news/old_2_2.jpg', '/files/news/old_2_3.jpg', '/files/news/old_2_4.jpg', "/files/news/old_2_5.jpg", "/files/news/old_2_6.jpg", '/files/news/old_2_7.jpg'],
    },
    {
        id: '2',
        title: 'День матері в Таїровському ліцеї',
        date: '09 травня 2025',
        images: [],
        category: 'Свята',
        content:
            `
            <p>У пʼятницю, 9.05, в 2-А класі (кл. керівник Сагінова О. А.) був особливий день — святкували День матері. Стільки щирих посмішок, обіймів і вдячних слів! Діти старалися від усього серця, і кожна мама в залі відчула, наскільки вона важлива й незамінна.</p>
            <p>Зі святом, наші найкращі мами! Ви — серце кожної родини.</p>`
    },
    {
        id: '1',
        title: 'День Європи в Таїровському ліцеї',
        date: '09 травня 2025',
        images: [],
        category: 'Свята',
        content: `
            <p>Кожен клас – своя європейська зірка! 🌟 </p>
            <p>Жеребкування об'єднало учнів Таїровського ліцею в спільному творчому проєкті до Дня Європи. З цікавістю дізнавшись свою країну, діти з ентузіазмом взялися за створення стенгазет. І ось результат – перші витвори юних талантів, сповнені знань та креативу! 🇪🇺📰</p>
            <p>Європа - це про спільні цінності, повагу та натхнення!</p>`
    }
];
