
import {NewsItem} from "@/components/ui/NewsCard.tsx";

export const news: NewsItem[] = [
    {
        id: '1',
        title: 'Призові місця на Всеукраїнському колоквіумі',
        excerpt: 'Наші учні здобули призові місця в обласному(заочному) етапі Всеукраїнського колоквіуму "Космос. Людина. Духовність". Вітаємо переможців та їхніх наставників!',
        date: '06 березня 2025',
        image: 'https://kucprppkmr.od.gov.ua/wp-content/uploads/2024/03/Ukrayinets-v-kosmosi_-SHavlovskyj-Vladyslav-Ruslanovych-Odeska-obl-1024x576.png',
        category: 'Досягнення',
        content: `
      <p>Наші учні здобули призові місця в обласному(заочному) етапі Всеукраїнського колоквіуму "Космос. Людина. Духовність". Вітаємо переможців та їхніх наставників!</p>`
    },
    {
        id: '2',
        title: 'Шкільна виставка проектів',
        excerpt: 'У нашому ліцеї пройшла виставка учнівських проєктів з природничих наук. Учні представили свої дослідження та експерименти.',
        date: '15 квітня 2025',
        images: [
            'https://images.unsplash.com/photo-1581091226825-a6a2a5aee158',
            'https://images.unsplash.com/photo-1605810230434-7631ac76ec81',
            'https://images.unsplash.com/photo-1487058792275-0ad4aaf24ca7'
        ],
        category: 'Події',
        content: `
      <p>У нашому ліцеї пройшла виставка учнівських проєктів з природничих наук. Учні представили свої дослідження та експерименти з фізики, хімії та біології.</p>
      <p>Захід був організований з метою розвитку наукового мислення та заохочення інтересу до природничих наук серед школярів. Кожен проект супроводжувався детальною презентацією та демонстрацією.</p>
      <p>Найкращі проекти будуть представлені на міському конкурсі наукових робіт наступного місяця.</p>`
    }
];
